//
//  Questions.swift
//  WhoWantToBeAMillionaire
//
//  Created by Никита Мошенцев on 18.05.2022.
//

import Foundation

struct Questions {
    let question: [String] = ["Какую фамилию носил главный герой поэмы А. Твардовского?",
                              "В песне какого барда есть строчка: 'Лыжи у печки стоят...' ?",
                              "Что в конце XIX века было основным товаром на Лубянской площади в Москве во время Введенской ярмарки?",
                              "Какой советский космонавт получил первую космическую почту?",
                              "Как называют звезду, которая указала волхвам место рождения Христа?",
                              "Где, если верить пословице, любопытной Варваре нос оторвали?",
                              "Как называют период времени, когда солнце в северных широтах не опускается за горизонт?",
                              "Кто автор проекта радиобашни на Шаболовке?",
                              "За чем послала жена мужа в мультфильме Падал прошлогодний снег?",
                              "Какой знак восточного гороскопа следует за знаком Дракона?"]
    
    let answers: [Int : [String]] = [ 0 : ["Петров", "Тёркин", "Иванов","Андреев"],
                                      1 : ["Владимир Высоцкий", "Виктор Цой", "Булат Окуджава","Юрий Визбор"],
                                      2 : ["Сани", "Клюшка", "Коньки","Ведро"],
                                      3 : ["Владимир Шаталов", "Герман Титов", "Юрий Гагарин","Валентина Терешкова"],
                                      4 : ["Иерусалимская", "Вифлеемская", "Полярная","Московская"],
                                      5 : ["На параде", "В бане", "В парадной","На базаре"],
                                      6 : ["Солнечный день", "Солнечная ночь", "Полярный день","Полярная ночь"],
                                      7 : ["Матвей Дынкин", "Эрнест Быков", "Владимир Шухов","Евгений Замятин"],
                                      8 : ["За углём", "За ёлкой", "За спичками","За ведром"],
                                      9 : ["Собака", "Еж", "Тигр","Змея"]]
    
    let correctAnswer: [String] = ["Тёркин",
                                   "Юрий Визбор",
                                   "Сани",
                                   "Владимир Шаталов",
                                   "Вифлеемская",
                                   "На базаре",
                                   "Полярный день",
                                   "Владимир Шухов",
                                   "За ёлкой",
                                   "Змея"]
}
